Revit 2024 API
View3D.ShowGridsOnLevel Method
 This method displays the grid lines in this 3DView on the given Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void ShowGridsOnLevel(
	ElementId levelId
)
Visual Basic
Public Sub ShowGridsOnLevel ( _
	levelId As ElementId _
)
Visual C++
public:
void ShowGridsOnLevel(
	ElementId^ levelId
)
Parameters
levelId
Type: Autodesk.Revit.DB.ElementId
 The id of the Level where grids should be displayed.
Remarks
 Grids will be displayed only if they intersects Level's plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View3D Class
Autodesk.Revit.DB Namespace